{
  "items": [
    {
      "number": "1",
      "title": "1 Авторизация",
      "content": "Авторизация"
    },
    {
      "number": "1_1",
      "title": "1.1 Общие понятия",
      "content": "    <b>Идентификация</b> — совокупность мероприятий по установлению сведений о лице и их проверке, осуществляемых в соответствии с федеральными законами и принимаемыми в соответствии с ними нормативными правовыми актами, и сопоставлению данных сведений с идентификатором. \n    <b>Аутентификация</b> — совокупность мероприятий по проверке лица на принадлежность ему идентификаторов посредством сопоставления их со сведениями о лице, которыми располагает лицо, проводящее аутентификацию, и установлению правомерности владения лицом идентификаторами посредством использования аутентифицирующих признаков в рамках процедуры аутентификации, в результате чего лицо считается установленным; \n    <b>Авторизация</b> — предоставление определённому лицу или группе лиц прав на выполнение определённых действий; а также процесс проверки (подтверждения) данных прав при попытке выполнения этих действий. \n    Обычно все три процесса идут последовательно: идентификация лица, проверка принадлежности идентификатора, выдача прав лицу."
    },
    {
      "number": "1_2",
      "title": "1.2 Виды аутентификации",
      "content": "    Существуют различные способы аутентификации по типу фактора аутентификации. Всего их можно разделить на три категории: по тому <b>что знает лицо</b> (пароли), <b>что есть у лица</b> (аппаратные средства) и <b>что принадлежит лицу</b> (биометрия)."
    },
    {
      "number": "1_2_1",
      "title": "1.2.1 Парольная",
      "content": "    Наиболее распространенный и простой способ, основанный на вводе пароля.\n    <b>Парольная аутентификация</b> – это процедура проверки подлинности пользователя путём сравнения введённого им пароля (для указанного логина) с паролем, сохранённым в базе данных пользовательских логинов. Главное достоинство парольной аутентификации – <b>простота и привычность</b>.\n    <u>Принцип работы:</u>\n      1. Пользователь вводит уникальный логин и пароль.\n      2. Система проверяет введенные данные по базе (например, хэш пароля).\n      3. При совпадении пользователь получает доступ.\n    <u>Типы паролей:</u>\n      - <b>Статические пароли</b>: используются многократно до изменения (традиционный вариант).\n      - <b>Динамические пароли</b>: Одноразовые (OTP), генерируются каждый раз заново. Например, отправляются по SMS или через приложение.\n    <u>Преимущества</u>:\n      - Простота внедрения.\n      - Не требует дополнительных устройств.\n    <u>Недостатки</u>:\n      - Легкость взлома при слабом пароле.\n      - Возможность утечки паролей (фишинг, взлом базы данных).\n      - Уязвимость к атакам 'грубой силы' (brute-force) или 'перебора'.\n    <u>Рекомендации по повышению безопасности</u>:\n      - Использование сложных паролей (длина, символы, регистр).\n      - Регулярная смена паролей.\n      - Применение шифрования при хранении паролей (например, хэширование с солью)."
    },
    {
      "number": "1_2_2",
      "title": "1.2.2 С использованием аппаратных средств",
      "content": "    Базируется на использовании лицом <b>физического устройства</b>, так называемого токена, которое содержит в себе уникальный код. Таким образом обладание этим устройством является подтверждением принадлежности идентификатора лицу.\n    <u>Принцип работы:</u>\n      1. Пользователь вводит свои учетные данные или идентифицирует себя через токен.\n      2. Система считывает идентификатор с токена (например, через USB, NFC, Bluetooth или QR-код).\n      3. Проверяется подлинность идентификатора в базе данных.\n      4. При совпадении пользователь получает доступ.\n    <u>Типы токенов:</u>\n      - Карты доступа (RFID, смарт-карты).\n      - USB-устройства (например, ключи безопасности).\n      - Биометрические токены (сканеры отпечатков пальцев).\n      - Мобильные приложения, генерирующие одноразовые коды (например, Google Authenticator).\n      - Софт-токены в виде уникальных цифровых идентификаторов.\n    <u>Преимущества:</u>\n      - Высокая устойчивость к атакам 'грубой силы'.\n      - Возможность комбинирования с другими методами (двухфакторная аутентификация).\n      - Отсутствие необходимости запоминать пароли.\n      - Усложнение процедуры несанкционированного доступа при физической защите токенов.\n    <u>Недостатки:</u>\n      - Потеря токена может привести к блокировке доступа.\n      - Требуется физическое наличие токена для доступа, что может быть неудобно.\n      - Возможность кражи токена.\n      - Стоимость внедрения и обслуживания, особенно для физических токенов."
    },
    {
      "number": "1_2_3",
      "title": "1.2.3 Биометрическая",
      "content": "    Основана на уникальных физических характеристиках или поведенческих особенностях человека.\n    Биометрическая аутентификация – это процесс обеспечения безопасности, который основан на технологии распознавания личности человека по его биологическим характеристикам. Уникальность этих характеристик позволяет подтвердить, является ли человек именно тем пользователем, за которого себя выдает. Биометрические данные человека загружаются в базу данных и являются эталонными. А далее при запросе доступа к информационному ресурсу системы биометрической аутентификации забирают введенные данные пользователя и сравнивают их с эталонными, хранящимися в базе. Если данные совпадают, то аутентификация считается успешной, подтвержденной и пользователь получает доступ к ресурсу.\n    <u>Типы биометрии:</u>\n      1. Физические признаки:\n        - Отпечатки пальцев: Чаще всего используется благодаря удобству и точности. Пример: смартфоны с сенсорами отпечатков.\n        - Сканирование лица: Работает на основе распознавания особенностей лица (контуров, расстояний между чертами).\n        - Сканирование радужной оболочки глаза: Более точный, но менее распространенный способ из-за высокой стоимости.\n        Голос: Распознавание уникальных особенностей речи пользователя.\n      2. Поведенческие характеристики:\n        - Манера набора текста на клавиатуре.\n        - Анализ почерка.\n        - Характер движения мыши.\n    <u>Преимущества:</u>\n      Высокая точность и сложность подделки.\n     Удобство (не нужно помнить пароли или носить устройства).\n    <u>Недостатки:</u>\n      Высокая стоимость оборудования.\n      Возможны ошибки: ложные срабатывания или отказ в доступе.\n      Угрозы приватности (сбор и хранение биометрических данных)."
    },
    {
      "number": "1_2_4",
      "title": "1.2.4 Многофакторная",
      "content": "    Многофакторная аутентификация (MFA) — это мера безопасности, в рамках которой пользователям требуется проходить более одной аутентификации для доступа к службе или приложению.\n    Многофакторная аутентификация объединяет два и более способа аутентификации для повышения безопасности. Для успешного входа требуется подтвердить личность несколькими независимыми методами. Методы совпадают с общими методами аутентификации: парольный, токенный, биометрический. Для обеспечения большей безопасности следует аутентификацию разными методами, например, сочетать парольную аутентификацию с токенной.\n    <u>Преимущества MFA:</u>\n      - Существенное повышение уровня безопасности.\n      - Сложность для злоумышленников, даже если один из факторов скомпрометирован.\n    <u>Недостатки:</u>\n      - Увеличение времени на вход.\n      - Возможность технических проблем (например, сбой SMS)."
    },
    {
      "number": "2",
      "title": "2 Модель управления доступом",
      "content": "    Модель управления доступом – это системы распределения полномочий в информационной инфраструктуре компаний. Они нужны для обеспечения необходимого уровня безопасности информационных ресурсов.\n    Выделяется несколько видов моделей управления доступом."
    },
    {
      "number": "2_1",
      "title": "2.1 Дискреционная",
      "content": "    Это метод управления, при котором доступ к информационным системам и ресурсам назначает отдельно каждому элементу и каждому пользователю. По факту суть модели заключается в том, что на основе идентификационной информации о субъектах создаются списки на использование тех или иных ресурсов с указанием полномочий конкретных лиц. При необходимости список прав можно расширить.\n    На базе атрибутов – права выдаются на основе рассматриваемых в моменте правил, привязанных к объектам (системам и ресурсам), субъектам (пользователям), конкретным операциям и рабочим задачам, окружению. В рамках этого подхода используется механизм автоматизации, оценивающий предоставленные атрибуты.\n    Таким образом модель получается очень гибкой, но требует больше времени на выделение всех прав новому лицу или для нового файла, поэтому является несовершенной."
    },
    {
      "number": "2_2",
      "title": "2.2 Ролевая",
      "content": "    Эта модель основана на назначении ролей – наборов полномочий, привязанных к конкретным должностям или рабочим задачам.\n    <u>Принцип работы:</u>\n      - Роли: Каждый пользователь в системе получает роль или несколько ролей, которые определяют его уровень доступа.\n      - Права доступа: Каждая роль имеет определённый набор прав на выполнение действий с ресурсами. Например, роль 'Программист' может иметь доступ только к офису, а роль 'Системный администратор' — к офису и к серверной комнате. Аналогичным образом распределяется доступ и к информации, содержащейся в компании.\n      - Пользователи: Пользователи назначаются на эти роли в зависимости от их должности или функции в организации. Права доступа, связанные с ролью, автоматически предоставляются пользователю при назначении ему соответствующей роли.\n      - Ресурсы: Система управляет доступом к данным, приложениям, файлам и другим ресурсам на основе ролей и их привилегий.\n    Такой подход упрощает выдачу прав, но если ролей становится слишком много, то эффективность этой модели сопоставима с дискретной моделью."
    },
    {
      "number": "2_3",
      "title": "2.3 Мандатная",
      "content": "    Каждому объекту в информационной системе присваиваются метки типа, например, «не секретно», «засекречено», «строго конфиденциально». Затем администраторы или владельцы систем назначают сотрудникам полномочия в соответствии с их должностными обязанностями. Например, кто-то получает право взаимодействовать только с объектами несекретного уровня, кто-то – с совершенно секретными ресурсами.\n    В рамках мандатной модели нельзя превышать назначенный уровень доступа. Если по каким-то причинам это необходимо, администраторы или владельцы систем создают для пользователей новые профили под актуальную метку ресурса.\n    Такое решения является наименее гибким, так как все пользователи разделены лишь по нескольким уровням допуска, но в то же время является наиболее безопасной. "
    },
    {
      "number": "3",
      "title": "3 Система аудита",
      "content": "    Система аудита — это механизм или набор инструментов, который отслеживает и записывает действия пользователей и системных процессов в информационной системе. Целью аудита является предоставление полной и достоверной информации о том, что происходило в системе, кто и когда выполнял определённые действия, какие ресурсы были затронуты и какие изменения были внесены. Система аудита служит важным инструментом для обеспечения безопасности, управления и соблюдения нормативных требований.\n    Система аудита фиксирует события в виде журналов (логов), которые содержат запись о произошедших действиях или изменениях в системе. \n    Обычно в журнал вносятся следующие события: авторизация и аутентификация пользователей, действия с ресурсами, управление правами доступа, системные события, ошибки, работа с сетевой инфраструктурой, общие изменения в системе.\n   В целом система аудита необходима для отслеживания действий в системе для обнаружения, предотвращения потенциально вредоносных действий до их совершения, а также для быстрого реагирования на них, путём постоянного мониторинга системы вручную или с помощью дополнительных систем. Также логи являются важным источником информации при расследовании инцидентов информационной информации, именно логи могут позволить восстановить хронологию событий и выявить нарушителей и понять, как был совершён инцидент, чтобы не допустить подобного вновь."
    }
  ]
}
