{
  "items": [
    {
      "number": "1",
      "title": "1 Авторизация",
      "content": ""
    },
    {
      "number": "1_1",
      "title": "1.1 Общие понятия",
      "content": ""
    },
    {
      "number": "1_2",
      "title": "1.2 Виды аутентификации",
      "content": ""
    },
    {
      "number": "1_2_1",
      "title": "1.2.1 Парольная",
      "content": ""
    },
    {
      "number": "1_2_2",
      "title": "1.2.2 С использованием аппаратных средств",
      "content": ""
    },
    {
      "number": "1_2_3",
      "title": "1.2.3 Биометрическая",
      "content": ""
    },
    {
      "number": "1_2_4",
      "title": "1.2.4 Многофакторная",
      "content": ""
    },
    {
      "number": "2",
      "title": "2 Модель управления досутпом",
      "content": ""
    },
    {
      "number": "2_1",
      "title": "2.1 Дискреционная",
      "content": ""
    },
    {
      "number": "2_2",
      "title": "2.2 Ролевая",
      "content": ""
    },
    {
      "number": "2_3",
      "title": "2.3 Мандатная",
      "content": ""
    },
    {
      "number": "3",
      "title": "3 Система аудита",
      "content": "    Система аудита — это механизм или набор инструментов, который отслеживает и записывает действия пользователей и системных процессов в информационной системе. Целью аудита является предоставление полной и достоверной информации о том, что происходило в системе, кто и когда выполнял определённые действия, какие ресурсы были затронуты и какие изменения были внесены. Система аудита служит важным инструментом для обеспечения безопасности, управления и соблюдения нормативных требований.\n    Система аудита фиксирует события в виде журналов (логов), которые содержат запись о произошедших действиях или изменениях в системе. \n    Обычно в журнал вносятся следующие события: авторизация и аутентификация пользователей, действия с ресурсами, управление правами доступа, системные события, ошибки, работа с сетевой инфраструктурой, общие изменения в системе.\n   В целом система аудита необходима для отслеживания действий в системе для обнаружения, предотвращения потенциально вредоносных действий до их совершения, а также для быстрого реагирования на них, путём постоянного мониторинга системы вручную или с помощью дополнительных систем. Также логи являются важным источником информации при расследовании инцидентов информационной информации, именно логи могут позволить восстановить хронологию событий и выявить нарушителей и понять, как был совершён инцидент, чтобы не допустить подобного вновь."
    }
  ]
}
